package batagodax

// rule is a struct to hold rules
type rule struct {
	Triggers  []string
	Responses []string
}

// Rules is a set of conversational rules
var Rules = []rule{
	rule{
		Triggers: []string{
			"හුකමු",
		},
		Responses: []string{
			"යකඩ බටේ ඇතුලට යවනකොටනං ඕව කියන්නෙ ​නෑ",
			"ම්ම්ම් සෙ​ස්",
			"බලපංකො තොට තියන විකෘති කාමා​ශා",
		},
	},
	rule{
		Triggers: []string{
			"හුත්",
			"හුක",
			"පක",
			"පකෝ",
			"පකේ",
			"කැරි",
			"වේ​සි",
		},
		Responses: []string{
			"මොකද හුත්තො කුණුහරප කියන්​නෙ",
			"අඩෝ අපිත් දන්නව හොඳ සිංහල",
			"උඹට දෙයක් කරගන්න බෑ කියල කියවන්න එපා",
		},
	},
	rule{
		Triggers: []string{
			"ආද​රේ",
			"ආදරෙ",
			"මනා​ප​යි",
			"මනාපෙ",
			"ල​වු",
		},
		Responses: []string{
			"ඔච්චර පදිරි වෙන්න එපා බොටෙක්ට ලවු කර​ල",
			"අපි ඔයාට පත්තරේ මංගල යෝජනාවක් දා​මු",
			"ම්ම්ම් අපි රැවටෙයි ඕව​ට",
		},
	},
	rule{
		Triggers: []string{
			"අම්ම",
			"මිනිහ",
			"මිනිහා",
			"ගෑනි",
			"කොල්ල",
			"කෙල්ල",
			"කෑල්ල",
			"බෝයි",
			"ගර්ල්",
		},
		Responses: []string{
			"උඹේ පවුල ගැන අහන්න තමයි මට වෙලා තියෙන්නෙ",
			"පවුල් ප්‍රශ්ණ වලට අපි නෑ ඕ​ං",
			"ඉතිං බං මට පාංද?",
		},
	},
	rule{
		Triggers: []string{
			"යන​ව",
			"යන​වා",
			"ගියා",
		},
		Responses: []string{
			"ඉතිං පලය​ං, මම ගඟේ පනින්නයැ?",
			"අම්මෝ ප​ල පල",
			"හුකා​ං",
			"ගිහිං මැරියං ​තෝ",
		},
	},
}

// Fallbacks are when all the matches fail
var Fallbacks = []string{
	"ඇයි හුත්තො ඕකම අහන්​නෙ?",
	"උඹටම උත්තර දීගන්න පුලුවන්ද බලහං ඉස්සෙල්​ල",
	"උත්තරේ කට අස්සෙ නේ තියං ඉන්​නෙ?",
	"ඇයි තොට ඕක කට ඇරල කියන්න බැ​රි?",
	"අනේ තව බොරුවක් කියපං​කො",
	"උඹේ පවුල ගැන අහන්න තමයි මට වෙලා තියෙන්නෙ",
	"තව බොරුවක් කියප​ං?",
	"ආ එහෙම​ද?",
	"මාරයි​නෙ",
	"ආ, එහෙම වුනාමවත් තොට තේරෙන්නෙ නැද්​ද?",
	"එතකොට හරි​ද?",
	"එහෙම කීවහම උඹට සතුටු​ද?",
	"මීට කලින් මාව දැකල නැද්ද?",
	"ඇයි පකෝ?",
	"තොට ඇම්ම කියල මම පලිද?",
	"තොපිගෙ මුල් ලමාවිය ප්‍රශ්න තමයි පෙන්නන්නෙ",
}
